In [2]:
import pandas as pd

In [6]:
arr={'Name':[1,2,3,4],"Age":[18,None,20,None]}
arr

{'Name': [1, 2, 3, 4], 'Age': [18, None, 20, None]}

In [12]:
arr['Name']
df=pd.DataFrame(arr)

In [13]:
df.fillna("Unkown",inplace=True)
df=pd.DataFrame(arr)

In [14]:
df

   Name   Age
0     1  18.0
1     2   NaN
2     3  20.0
3     4   NaN

In [38]:
df.fillna('Abu',inplace=True)

In [39]:
df

   Name   Age
0     1  18.0
1     2   Abu
2     3  20.0
3     4   Abu

In [43]:
df.loc[0]=([1,18])

In [44]:
df.loc[0]

Name     1
Age     18
Name: 0, dtype: object

In [45]:
df

   Name   Age
0     1    18
1     2   Abu
2     3  20.0
3     4   Abu

In [46]:
df.loc[1]=['Thahi',21]

In [47]:
df

    Name   Age
0      1    18
1  Thahi    21
2      3  20.0
3      4   Abu